---
title: UnitTypeId
classe: Autodesk.Revit.DB.UnitTypeId
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 303
---

# UnitTypeId

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ForgeTypeId Acres { get; }` | `UnitTypeId.Acres` | ForgeTypeId |
| `ForgeTypeId Amperes { get; }` | `UnitTypeId.Amperes` | ForgeTypeId |
| `ForgeTypeId Atmospheres { get; }` | `UnitTypeId.Atmospheres` | ForgeTypeId |
| `ForgeTypeId Bars { get; }` | `UnitTypeId.Bars` | ForgeTypeId |
| `ForgeTypeId BritishThermalUnits { get; }` | `UnitTypeId.BritishThermalUnits` | ForgeTypeId |
| `ForgeTypeId BritishThermalUnitsPerDegreeFahrenheit { get; }` | `UnitTypeId.BritishThermalUnitsPerDegreeFahrenheit` | ForgeTypeId |
| `ForgeTypeId BritishThermalUnitsPerHour { get; }` | `UnitTypeId.BritishThermalUnitsPerHour` | ForgeTypeId |
| `ForgeTypeId BritishThermalUnitsPerHourCubicFoot { get; }` | `UnitTypeId.BritishThermalUnitsPerHourCubicFoot` | ForgeTypeId |
| `ForgeTypeId BritishThermalUnitsPerHourFootDegreeFahrenheit { get; }` | `UnitTypeId.BritishThermalUnitsPerHourFootDegreeFahrenheit` | ForgeTypeId |
| `ForgeTypeId BritishThermalUnitsPerHourSquareFoot { get; }` | `UnitTypeId.BritishThermalUnitsPerHourSquareFoot` | ForgeTypeId |
| `ForgeTypeId BritishThermalUnitsPerHourSquareFootDegreeFahrenheit { get; }` | `UnitTypeId.BritishThermalUnitsPerHourSquareFootDegreeFahrenheit` | ForgeTypeId |
| `ForgeTypeId BritishThermalUnitsPerPound { get; }` | `UnitTypeId.BritishThermalUnitsPerPound` | ForgeTypeId |
| `ForgeTypeId BritishThermalUnitsPerPoundDegreeFahrenheit { get; }` | `UnitTypeId.BritishThermalUnitsPerPoundDegreeFahrenheit` | ForgeTypeId |
| `ForgeTypeId BritishThermalUnitsPerSecond { get; }` | `UnitTypeId.BritishThermalUnitsPerSecond` | ForgeTypeId |
| `ForgeTypeId BritishThermalUnitsPerSquareFootDegreeFahrenheit { get; }` | `UnitTypeId.BritishThermalUnitsPerSquareFootDegreeFahrenheit` | ForgeTypeId |
| `ForgeTypeId Calories { get; }` | `UnitTypeId.Calories` | ForgeTypeId |
| `ForgeTypeId CaloriesPerSecond { get; }` | `UnitTypeId.CaloriesPerSecond` | ForgeTypeId |
| `ForgeTypeId Candelas { get; }` | `UnitTypeId.Candelas` | ForgeTypeId |
| `ForgeTypeId CandelasPerSquareFoot { get; }` | `UnitTypeId.CandelasPerSquareFoot` | ForgeTypeId |
| `ForgeTypeId CandelasPerSquareMeter { get; }` | `UnitTypeId.CandelasPerSquareMeter` | ForgeTypeId |
| `ForgeTypeId Celsius { get; }` | `UnitTypeId.Celsius` | ForgeTypeId |
| `ForgeTypeId CelsiusInterval { get; }` | `UnitTypeId.CelsiusInterval` | ForgeTypeId |
| `ForgeTypeId Centimeters { get; }` | `UnitTypeId.Centimeters` | ForgeTypeId |
| `ForgeTypeId CentimetersPerMinute { get; }` | `UnitTypeId.CentimetersPerMinute` | ForgeTypeId |
| `ForgeTypeId CentimetersToTheFourthPower { get; }` | `UnitTypeId.CentimetersToTheFourthPower` | ForgeTypeId |
| `ForgeTypeId CentimetersToTheSixthPower { get; }` | `UnitTypeId.CentimetersToTheSixthPower` | ForgeTypeId |
| `ForgeTypeId Centipoises { get; }` | `UnitTypeId.Centipoises` | ForgeTypeId |
| `ForgeTypeId CubicCentimeters { get; }` | `UnitTypeId.CubicCentimeters` | ForgeTypeId |
| `ForgeTypeId CubicFeet { get; }` | `UnitTypeId.CubicFeet` | ForgeTypeId |
| `ForgeTypeId CubicFeetPerHour { get; }` | `UnitTypeId.CubicFeetPerHour` | ForgeTypeId |
| `ForgeTypeId CubicFeetPerKip { get; }` | `UnitTypeId.CubicFeetPerKip` | ForgeTypeId |
| `ForgeTypeId CubicFeetPerMinute { get; }` | `UnitTypeId.CubicFeetPerMinute` | ForgeTypeId |
| `ForgeTypeId CubicFeetPerMinuteCubicFoot { get; }` | `UnitTypeId.CubicFeetPerMinuteCubicFoot` | ForgeTypeId |
| `ForgeTypeId CubicFeetPerMinutePerBritishThermalUnitPerHour { get; }` | `UnitTypeId.CubicFeetPerMinutePerBritishThermalUnitPerHour` | ForgeTypeId |
| `ForgeTypeId CubicFeetPerMinuteSquareFoot { get; }` | `UnitTypeId.CubicFeetPerMinuteSquareFoot` | ForgeTypeId |
| `ForgeTypeId CubicFeetPerMinuteTonOfRefrigeration { get; }` | `UnitTypeId.CubicFeetPerMinuteTonOfRefrigeration` | ForgeTypeId |
| `ForgeTypeId CubicFeetPerPoundMass { get; }` | `UnitTypeId.CubicFeetPerPoundMass` | ForgeTypeId |
| `ForgeTypeId CubicInches { get; }` | `UnitTypeId.CubicInches` | ForgeTypeId |
| `ForgeTypeId CubicMeters { get; }` | `UnitTypeId.CubicMeters` | ForgeTypeId |
| `ForgeTypeId CubicMetersPerHour { get; }` | `UnitTypeId.CubicMetersPerHour` | ForgeTypeId |
| `ForgeTypeId CubicMetersPerHourCubicMeter { get; }` | `UnitTypeId.CubicMetersPerHourCubicMeter` | ForgeTypeId |
| `ForgeTypeId CubicMetersPerHourSquareMeter { get; }` | `UnitTypeId.CubicMetersPerHourSquareMeter` | ForgeTypeId |
| `ForgeTypeId CubicMetersPerKilogram { get; }` | `UnitTypeId.CubicMetersPerKilogram` | ForgeTypeId |
| `ForgeTypeId CubicMetersPerKilonewton { get; }` | `UnitTypeId.CubicMetersPerKilonewton` | ForgeTypeId |
| `ForgeTypeId CubicMetersPerSecond { get; }` | `UnitTypeId.CubicMetersPerSecond` | ForgeTypeId |
| `ForgeTypeId CubicMetersPerWattSecond { get; }` | `UnitTypeId.CubicMetersPerWattSecond` | ForgeTypeId |
| `ForgeTypeId CubicMillimeters { get; }` | `UnitTypeId.CubicMillimeters` | ForgeTypeId |
| `ForgeTypeId CubicYards { get; }` | `UnitTypeId.CubicYards` | ForgeTypeId |
| `ForgeTypeId Currency { get; }` | `UnitTypeId.Currency` | ForgeTypeId |
| `ForgeTypeId CurrencyPerBritishThermalUnit { get; }` | `UnitTypeId.CurrencyPerBritishThermalUnit` | ForgeTypeId |
| `ForgeTypeId CurrencyPerBritishThermalUnitPerHour { get; }` | `UnitTypeId.CurrencyPerBritishThermalUnitPerHour` | ForgeTypeId |
| `ForgeTypeId CurrencyPerSquareFoot { get; }` | `UnitTypeId.CurrencyPerSquareFoot` | ForgeTypeId |
| `ForgeTypeId CurrencyPerSquareMeter { get; }` | `UnitTypeId.CurrencyPerSquareMeter` | ForgeTypeId |
| `ForgeTypeId CurrencyPerWatt { get; }` | `UnitTypeId.CurrencyPerWatt` | ForgeTypeId |
| `ForgeTypeId CurrencyPerWattHour { get; }` | `UnitTypeId.CurrencyPerWattHour` | ForgeTypeId |
| `ForgeTypeId Custom { get; }` | `UnitTypeId.Custom` | ForgeTypeId |
| `ForgeTypeId CyclesPerSecond { get; }` | `UnitTypeId.CyclesPerSecond` | ForgeTypeId |
| `ForgeTypeId Decimeters { get; }` | `UnitTypeId.Decimeters` | ForgeTypeId |
| `ForgeTypeId Degrees { get; }` | `UnitTypeId.Degrees` | ForgeTypeId |
| `ForgeTypeId DegreesMinutes { get; }` | `UnitTypeId.DegreesMinutes` | ForgeTypeId |
| `ForgeTypeId DekanewtonMeters { get; }` | `UnitTypeId.DekanewtonMeters` | ForgeTypeId |
| `ForgeTypeId DekanewtonMetersPerMeter { get; }` | `UnitTypeId.DekanewtonMetersPerMeter` | ForgeTypeId |
| `ForgeTypeId Dekanewtons { get; }` | `UnitTypeId.Dekanewtons` | ForgeTypeId |
| `ForgeTypeId DekanewtonsPerMeter { get; }` | `UnitTypeId.DekanewtonsPerMeter` | ForgeTypeId |
| `ForgeTypeId DekanewtonsPerSquareMeter { get; }` | `UnitTypeId.DekanewtonsPerSquareMeter` | ForgeTypeId |
| `ForgeTypeId Fahrenheit { get; }` | `UnitTypeId.Fahrenheit` | ForgeTypeId |
| `ForgeTypeId FahrenheitInterval { get; }` | `UnitTypeId.FahrenheitInterval` | ForgeTypeId |
| `ForgeTypeId Feet { get; }` | `UnitTypeId.Feet` | ForgeTypeId |
| `ForgeTypeId FeetFractionalInches { get; }` | `UnitTypeId.FeetFractionalInches` | ForgeTypeId |
| `ForgeTypeId FeetOfWater39_2DegreesFahrenheit { get; }` | `UnitTypeId.FeetOfWater39_2DegreesFahrenheit` | ForgeTypeId |
| `ForgeTypeId FeetOfWater39_2DegreesFahrenheitPer100Feet { get; }` | `UnitTypeId.FeetOfWater39_2DegreesFahrenheitPer100Feet` | ForgeTypeId |
| `ForgeTypeId FeetPerKip { get; }` | `UnitTypeId.FeetPerKip` | ForgeTypeId |
| `ForgeTypeId FeetPerMinute { get; }` | `UnitTypeId.FeetPerMinute` | ForgeTypeId |
| `ForgeTypeId FeetPerSecond { get; }` | `UnitTypeId.FeetPerSecond` | ForgeTypeId |
| `ForgeTypeId FeetPerSecondSquared { get; }` | `UnitTypeId.FeetPerSecondSquared` | ForgeTypeId |
| `ForgeTypeId FeetToTheFourthPower { get; }` | `UnitTypeId.FeetToTheFourthPower` | ForgeTypeId |
| `ForgeTypeId FeetToTheSixthPower { get; }` | `UnitTypeId.FeetToTheSixthPower` | ForgeTypeId |
| `ForgeTypeId Fixed { get; }` | `UnitTypeId.Fixed` | ForgeTypeId |
| `ForgeTypeId Footcandles { get; }` | `UnitTypeId.Footcandles` | ForgeTypeId |
| `ForgeTypeId Footlamberts { get; }` | `UnitTypeId.Footlamberts` | ForgeTypeId |
| `ForgeTypeId FractionalInches { get; }` | `UnitTypeId.FractionalInches` | ForgeTypeId |
| `ForgeTypeId General { get; }` | `UnitTypeId.General` | ForgeTypeId |
| `ForgeTypeId Gigajoules { get; }` | `UnitTypeId.Gigajoules` | ForgeTypeId |
| `ForgeTypeId Gradians { get; }` | `UnitTypeId.Gradians` | ForgeTypeId |
| `ForgeTypeId GrainsPerHourSquareFootInchMercury { get; }` | `UnitTypeId.GrainsPerHourSquareFootInchMercury` | ForgeTypeId |
| `ForgeTypeId Hectares { get; }` | `UnitTypeId.Hectares` | ForgeTypeId |
| `ForgeTypeId Hertz { get; }` | `UnitTypeId.Hertz` | ForgeTypeId |
| `ForgeTypeId Horsepower { get; }` | `UnitTypeId.Horsepower` | ForgeTypeId |
| `ForgeTypeId Hours { get; }` | `UnitTypeId.Hours` | ForgeTypeId |
| `ForgeTypeId HourSquareFootDegreesFahrenheitPerBritishThermalUnit { get; }` | `UnitTypeId.HourSquareFootDegreesFahrenheitPerBritishThermalUnit` | ForgeTypeId |
| `ForgeTypeId Inches { get; }` | `UnitTypeId.Inches` | ForgeTypeId |
| `ForgeTypeId InchesOfMercury32DegreesFahrenheit { get; }` | `UnitTypeId.InchesOfMercury32DegreesFahrenheit` | ForgeTypeId |
| `ForgeTypeId InchesOfWater60DegreesFahrenheit { get; }` | `UnitTypeId.InchesOfWater60DegreesFahrenheit` | ForgeTypeId |
| `ForgeTypeId InchesOfWater60DegreesFahrenheitPer100Feet { get; }` | `UnitTypeId.InchesOfWater60DegreesFahrenheitPer100Feet` | ForgeTypeId |
| `ForgeTypeId InchesPerSecondSquared { get; }` | `UnitTypeId.InchesPerSecondSquared` | ForgeTypeId |
| `ForgeTypeId InchesToTheFourthPower { get; }` | `UnitTypeId.InchesToTheFourthPower` | ForgeTypeId |
| `ForgeTypeId InchesToTheSixthPower { get; }` | `UnitTypeId.InchesToTheSixthPower` | ForgeTypeId |
| `ForgeTypeId InverseDegreesCelsius { get; }` | `UnitTypeId.InverseDegreesCelsius` | ForgeTypeId |
| `ForgeTypeId InverseDegreesFahrenheit { get; }` | `UnitTypeId.InverseDegreesFahrenheit` | ForgeTypeId |
| `ForgeTypeId InverseKilonewtons { get; }` | `UnitTypeId.InverseKilonewtons` | ForgeTypeId |
| `ForgeTypeId InverseKips { get; }` | `UnitTypeId.InverseKips` | ForgeTypeId |
| `ForgeTypeId Joules { get; }` | `UnitTypeId.Joules` | ForgeTypeId |
| `ForgeTypeId JoulesPerGram { get; }` | `UnitTypeId.JoulesPerGram` | ForgeTypeId |
| `ForgeTypeId JoulesPerGramDegreeCelsius { get; }` | `UnitTypeId.JoulesPerGramDegreeCelsius` | ForgeTypeId |
| `ForgeTypeId JoulesPerKelvin { get; }` | `UnitTypeId.JoulesPerKelvin` | ForgeTypeId |
| `ForgeTypeId JoulesPerKilogramDegreeCelsius { get; }` | `UnitTypeId.JoulesPerKilogramDegreeCelsius` | ForgeTypeId |
| `ForgeTypeId JoulesPerSquareMeterKelvin { get; }` | `UnitTypeId.JoulesPerSquareMeterKelvin` | ForgeTypeId |
| `ForgeTypeId Kelvin { get; }` | `UnitTypeId.Kelvin` | ForgeTypeId |
| `ForgeTypeId KelvinInterval { get; }` | `UnitTypeId.KelvinInterval` | ForgeTypeId |
| `ForgeTypeId Kiloamperes { get; }` | `UnitTypeId.Kiloamperes` | ForgeTypeId |
| `ForgeTypeId Kilocalories { get; }` | `UnitTypeId.Kilocalories` | ForgeTypeId |
| `ForgeTypeId KilocaloriesPerSecond { get; }` | `UnitTypeId.KilocaloriesPerSecond` | ForgeTypeId |
| `ForgeTypeId KilogramForceMeters { get; }` | `UnitTypeId.KilogramForceMeters` | ForgeTypeId |
| `ForgeTypeId KilogramForceMetersPerMeter { get; }` | `UnitTypeId.KilogramForceMetersPerMeter` | ForgeTypeId |
| `ForgeTypeId Kilograms { get; }` | `UnitTypeId.Kilograms` | ForgeTypeId |
| `ForgeTypeId KilogramsForce { get; }` | `UnitTypeId.KilogramsForce` | ForgeTypeId |
| `ForgeTypeId KilogramsForcePerMeter { get; }` | `UnitTypeId.KilogramsForcePerMeter` | ForgeTypeId |
| `ForgeTypeId KilogramsForcePerSquareMeter { get; }` | `UnitTypeId.KilogramsForcePerSquareMeter` | ForgeTypeId |
| `ForgeTypeId KilogramsPerCubicMeter { get; }` | `UnitTypeId.KilogramsPerCubicMeter` | ForgeTypeId |
| `ForgeTypeId KilogramsPerHour { get; }` | `UnitTypeId.KilogramsPerHour` | ForgeTypeId |
| `ForgeTypeId KilogramsPerKilogramKelvin { get; }` | `UnitTypeId.KilogramsPerKilogramKelvin` | ForgeTypeId |
| `ForgeTypeId KilogramsPerMeter { get; }` | `UnitTypeId.KilogramsPerMeter` | ForgeTypeId |
| `ForgeTypeId KilogramsPerMeterHour { get; }` | `UnitTypeId.KilogramsPerMeterHour` | ForgeTypeId |
| `ForgeTypeId KilogramsPerMeterSecond { get; }` | `UnitTypeId.KilogramsPerMeterSecond` | ForgeTypeId |
| `ForgeTypeId KilogramsPerMinute { get; }` | `UnitTypeId.KilogramsPerMinute` | ForgeTypeId |
| `ForgeTypeId KilogramsPerSecond { get; }` | `UnitTypeId.KilogramsPerSecond` | ForgeTypeId |
| `ForgeTypeId KilogramsPerSquareMeter { get; }` | `UnitTypeId.KilogramsPerSquareMeter` | ForgeTypeId |
| `ForgeTypeId Kilojoules { get; }` | `UnitTypeId.Kilojoules` | ForgeTypeId |
| `ForgeTypeId KilojoulesPerKelvin { get; }` | `UnitTypeId.KilojoulesPerKelvin` | ForgeTypeId |
| `ForgeTypeId KilojoulesPerSquareMeterKelvin { get; }` | `UnitTypeId.KilojoulesPerSquareMeterKelvin` | ForgeTypeId |
| `ForgeTypeId KilometersPerHour { get; }` | `UnitTypeId.KilometersPerHour` | ForgeTypeId |
| `ForgeTypeId KilometersPerSecondSquared { get; }` | `UnitTypeId.KilometersPerSecondSquared` | ForgeTypeId |
| `ForgeTypeId KilonewtonMeters { get; }` | `UnitTypeId.KilonewtonMeters` | ForgeTypeId |
| `ForgeTypeId KilonewtonMetersPerDegree { get; }` | `UnitTypeId.KilonewtonMetersPerDegree` | ForgeTypeId |
| `ForgeTypeId KilonewtonMetersPerDegreePerMeter { get; }` | `UnitTypeId.KilonewtonMetersPerDegreePerMeter` | ForgeTypeId |
| `ForgeTypeId KilonewtonMetersPerMeter { get; }` | `UnitTypeId.KilonewtonMetersPerMeter` | ForgeTypeId |
| `ForgeTypeId Kilonewtons { get; }` | `UnitTypeId.Kilonewtons` | ForgeTypeId |
| `ForgeTypeId KilonewtonsPerCubicMeter { get; }` | `UnitTypeId.KilonewtonsPerCubicMeter` | ForgeTypeId |
| `ForgeTypeId KilonewtonsPerMeter { get; }` | `UnitTypeId.KilonewtonsPerMeter` | ForgeTypeId |
| `ForgeTypeId KilonewtonsPerSquareCentimeter { get; }` | `UnitTypeId.KilonewtonsPerSquareCentimeter` | ForgeTypeId |
| `ForgeTypeId KilonewtonsPerSquareMeter { get; }` | `UnitTypeId.KilonewtonsPerSquareMeter` | ForgeTypeId |
| `ForgeTypeId KilonewtonsPerSquareMillimeter { get; }` | `UnitTypeId.KilonewtonsPerSquareMillimeter` | ForgeTypeId |
| `ForgeTypeId Kilopascals { get; }` | `UnitTypeId.Kilopascals` | ForgeTypeId |
| `ForgeTypeId KilovoltAmperes { get; }` | `UnitTypeId.KilovoltAmperes` | ForgeTypeId |
| `ForgeTypeId Kilovolts { get; }` | `UnitTypeId.Kilovolts` | ForgeTypeId |
| `ForgeTypeId KilowattHours { get; }` | `UnitTypeId.KilowattHours` | ForgeTypeId |
| `ForgeTypeId Kilowatts { get; }` | `UnitTypeId.Kilowatts` | ForgeTypeId |
| `ForgeTypeId KipFeet { get; }` | `UnitTypeId.KipFeet` | ForgeTypeId |
| `ForgeTypeId KipFeetPerDegree { get; }` | `UnitTypeId.KipFeetPerDegree` | ForgeTypeId |
| `ForgeTypeId KipFeetPerDegreePerFoot { get; }` | `UnitTypeId.KipFeetPerDegreePerFoot` | ForgeTypeId |
| `ForgeTypeId KipFeetPerFoot { get; }` | `UnitTypeId.KipFeetPerFoot` | ForgeTypeId |
| `ForgeTypeId Kips { get; }` | `UnitTypeId.Kips` | ForgeTypeId |
| `ForgeTypeId KipsPerCubicFoot { get; }` | `UnitTypeId.KipsPerCubicFoot` | ForgeTypeId |
| `ForgeTypeId KipsPerCubicInch { get; }` | `UnitTypeId.KipsPerCubicInch` | ForgeTypeId |
| `ForgeTypeId KipsPerFoot { get; }` | `UnitTypeId.KipsPerFoot` | ForgeTypeId |
| `ForgeTypeId KipsPerInch { get; }` | `UnitTypeId.KipsPerInch` | ForgeTypeId |
| `ForgeTypeId KipsPerSquareFoot { get; }` | `UnitTypeId.KipsPerSquareFoot` | ForgeTypeId |
| `ForgeTypeId KipsPerSquareInch { get; }` | `UnitTypeId.KipsPerSquareInch` | ForgeTypeId |
| `ForgeTypeId Liters { get; }` | `UnitTypeId.Liters` | ForgeTypeId |
| `ForgeTypeId LitersPerHour { get; }` | `UnitTypeId.LitersPerHour` | ForgeTypeId |
| `ForgeTypeId LitersPerMinute { get; }` | `UnitTypeId.LitersPerMinute` | ForgeTypeId |
| `ForgeTypeId LitersPerSecond { get; }` | `UnitTypeId.LitersPerSecond` | ForgeTypeId |
| `ForgeTypeId LitersPerSecondCubicMeter { get; }` | `UnitTypeId.LitersPerSecondCubicMeter` | ForgeTypeId |
| `ForgeTypeId LitersPerSecondKilowatt { get; }` | `UnitTypeId.LitersPerSecondKilowatt` | ForgeTypeId |
| `ForgeTypeId LitersPerSecondSquareMeter { get; }` | `UnitTypeId.LitersPerSecondSquareMeter` | ForgeTypeId |
| `ForgeTypeId Lumens { get; }` | `UnitTypeId.Lumens` | ForgeTypeId |
| `ForgeTypeId LumensPerWatt { get; }` | `UnitTypeId.LumensPerWatt` | ForgeTypeId |
| `ForgeTypeId Lux { get; }` | `UnitTypeId.Lux` | ForgeTypeId |
| `ForgeTypeId Megajoules { get; }` | `UnitTypeId.Megajoules` | ForgeTypeId |
| `ForgeTypeId MeganewtonMeters { get; }` | `UnitTypeId.MeganewtonMeters` | ForgeTypeId |
| `ForgeTypeId MeganewtonMetersPerMeter { get; }` | `UnitTypeId.MeganewtonMetersPerMeter` | ForgeTypeId |
| `ForgeTypeId Meganewtons { get; }` | `UnitTypeId.Meganewtons` | ForgeTypeId |
| `ForgeTypeId MeganewtonsPerMeter { get; }` | `UnitTypeId.MeganewtonsPerMeter` | ForgeTypeId |
| `ForgeTypeId MeganewtonsPerSquareMeter { get; }` | `UnitTypeId.MeganewtonsPerSquareMeter` | ForgeTypeId |
| `ForgeTypeId Megapascals { get; }` | `UnitTypeId.Megapascals` | ForgeTypeId |
| `ForgeTypeId Megawatts { get; }` | `UnitTypeId.Megawatts` | ForgeTypeId |
| `ForgeTypeId Meters { get; }` | `UnitTypeId.Meters` | ForgeTypeId |
| `ForgeTypeId MetersCentimeters { get; }` | `UnitTypeId.MetersCentimeters` | ForgeTypeId |
| `ForgeTypeId MetersOfWaterColumn { get; }` | `UnitTypeId.MetersOfWaterColumn` | ForgeTypeId |
| `ForgeTypeId MetersOfWaterColumnPerMeter { get; }` | `UnitTypeId.MetersOfWaterColumnPerMeter` | ForgeTypeId |
| `ForgeTypeId MetersPerKilonewton { get; }` | `UnitTypeId.MetersPerKilonewton` | ForgeTypeId |
| `ForgeTypeId MetersPerSecond { get; }` | `UnitTypeId.MetersPerSecond` | ForgeTypeId |
| `ForgeTypeId MetersPerSecondSquared { get; }` | `UnitTypeId.MetersPerSecondSquared` | ForgeTypeId |
| `ForgeTypeId MetersToTheFourthPower { get; }` | `UnitTypeId.MetersToTheFourthPower` | ForgeTypeId |
| `ForgeTypeId MetersToTheSixthPower { get; }` | `UnitTypeId.MetersToTheSixthPower` | ForgeTypeId |
| `ForgeTypeId MicroinchesPerInchDegreeFahrenheit { get; }` | `UnitTypeId.MicroinchesPerInchDegreeFahrenheit` | ForgeTypeId |
| `ForgeTypeId MicrometersPerMeterDegreeCelsius { get; }` | `UnitTypeId.MicrometersPerMeterDegreeCelsius` | ForgeTypeId |
| `ForgeTypeId MilesPerHour { get; }` | `UnitTypeId.MilesPerHour` | ForgeTypeId |
| `ForgeTypeId MilesPerSecondSquared { get; }` | `UnitTypeId.MilesPerSecondSquared` | ForgeTypeId |
| `ForgeTypeId Milliamperes { get; }` | `UnitTypeId.Milliamperes` | ForgeTypeId |
| `ForgeTypeId Millimeters { get; }` | `UnitTypeId.Millimeters` | ForgeTypeId |
| `ForgeTypeId MillimetersOfMercury { get; }` | `UnitTypeId.MillimetersOfMercury` | ForgeTypeId |
| `ForgeTypeId MillimetersOfWaterColumn { get; }` | `UnitTypeId.MillimetersOfWaterColumn` | ForgeTypeId |
| `ForgeTypeId MillimetersOfWaterColumnPerMeter { get; }` | `UnitTypeId.MillimetersOfWaterColumnPerMeter` | ForgeTypeId |
| `ForgeTypeId MillimetersToTheFourthPower { get; }` | `UnitTypeId.MillimetersToTheFourthPower` | ForgeTypeId |
| `ForgeTypeId MillimetersToTheSixthPower { get; }` | `UnitTypeId.MillimetersToTheSixthPower` | ForgeTypeId |
| `ForgeTypeId Milliseconds { get; }` | `UnitTypeId.Milliseconds` | ForgeTypeId |
| `ForgeTypeId Millivolts { get; }` | `UnitTypeId.Millivolts` | ForgeTypeId |
| `ForgeTypeId Minutes { get; }` | `UnitTypeId.Minutes` | ForgeTypeId |
| `ForgeTypeId NanogramsPerPascalSecondSquareMeter { get; }` | `UnitTypeId.NanogramsPerPascalSecondSquareMeter` | ForgeTypeId |
| `ForgeTypeId NewtonMeters { get; }` | `UnitTypeId.NewtonMeters` | ForgeTypeId |
| `ForgeTypeId NewtonMetersPerMeter { get; }` | `UnitTypeId.NewtonMetersPerMeter` | ForgeTypeId |
| `ForgeTypeId Newtons { get; }` | `UnitTypeId.Newtons` | ForgeTypeId |
| `ForgeTypeId NewtonSecondsPerSquareMeter { get; }` | `UnitTypeId.NewtonSecondsPerSquareMeter` | ForgeTypeId |
| `ForgeTypeId NewtonsPerMeter { get; }` | `UnitTypeId.NewtonsPerMeter` | ForgeTypeId |
| `ForgeTypeId NewtonsPerSquareMeter { get; }` | `UnitTypeId.NewtonsPerSquareMeter` | ForgeTypeId |
| `ForgeTypeId NewtonsPerSquareMillimeter { get; }` | `UnitTypeId.NewtonsPerSquareMillimeter` | ForgeTypeId |
| `ForgeTypeId OhmMeters { get; }` | `UnitTypeId.OhmMeters` | ForgeTypeId |
| `ForgeTypeId OneToRatio { get; }` | `UnitTypeId.OneToRatio` | ForgeTypeId |
| `ForgeTypeId Pascals { get; }` | `UnitTypeId.Pascals` | ForgeTypeId |
| `ForgeTypeId PascalSeconds { get; }` | `UnitTypeId.PascalSeconds` | ForgeTypeId |
| `ForgeTypeId PascalsPerMeter { get; }` | `UnitTypeId.PascalsPerMeter` | ForgeTypeId |
| `ForgeTypeId Percentage { get; }` | `UnitTypeId.Percentage` | ForgeTypeId |
| `ForgeTypeId PerMille { get; }` | `UnitTypeId.PerMille` | ForgeTypeId |
| `ForgeTypeId Pi { get; }` | `UnitTypeId.Pi` | ForgeTypeId |
| `ForgeTypeId PoundForceFeet { get; }` | `UnitTypeId.PoundForceFeet` | ForgeTypeId |
| `ForgeTypeId PoundForceFeetPerFoot { get; }` | `UnitTypeId.PoundForceFeetPerFoot` | ForgeTypeId |
| `ForgeTypeId PoundForceSecondsPerSquareFoot { get; }` | `UnitTypeId.PoundForceSecondsPerSquareFoot` | ForgeTypeId |
| `ForgeTypeId PoundsForce { get; }` | `UnitTypeId.PoundsForce` | ForgeTypeId |
| `ForgeTypeId PoundsForcePerCubicFoot { get; }` | `UnitTypeId.PoundsForcePerCubicFoot` | ForgeTypeId |
| `ForgeTypeId PoundsForcePerFoot { get; }` | `UnitTypeId.PoundsForcePerFoot` | ForgeTypeId |
| `ForgeTypeId PoundsForcePerSquareFoot { get; }` | `UnitTypeId.PoundsForcePerSquareFoot` | ForgeTypeId |
| `ForgeTypeId PoundsForcePerSquareInch { get; }` | `UnitTypeId.PoundsForcePerSquareInch` | ForgeTypeId |
| `ForgeTypeId PoundsMass { get; }` | `UnitTypeId.PoundsMass` | ForgeTypeId |
| `ForgeTypeId PoundsMassPerCubicFoot { get; }` | `UnitTypeId.PoundsMassPerCubicFoot` | ForgeTypeId |
| `ForgeTypeId PoundsMassPerCubicInch { get; }` | `UnitTypeId.PoundsMassPerCubicInch` | ForgeTypeId |
| `ForgeTypeId PoundsMassPerFoot { get; }` | `UnitTypeId.PoundsMassPerFoot` | ForgeTypeId |
| `ForgeTypeId PoundsMassPerFootHour { get; }` | `UnitTypeId.PoundsMassPerFootHour` | ForgeTypeId |
| `ForgeTypeId PoundsMassPerFootSecond { get; }` | `UnitTypeId.PoundsMassPerFootSecond` | ForgeTypeId |
| `ForgeTypeId PoundsMassPerHour { get; }` | `UnitTypeId.PoundsMassPerHour` | ForgeTypeId |
| `ForgeTypeId PoundsMassPerMinute { get; }` | `UnitTypeId.PoundsMassPerMinute` | ForgeTypeId |
| `ForgeTypeId PoundsMassPerPoundDegreeFahrenheit { get; }` | `UnitTypeId.PoundsMassPerPoundDegreeFahrenheit` | ForgeTypeId |
| `ForgeTypeId PoundsMassPerSecond { get; }` | `UnitTypeId.PoundsMassPerSecond` | ForgeTypeId |
| `ForgeTypeId PoundsMassPerSquareFoot { get; }` | `UnitTypeId.PoundsMassPerSquareFoot` | ForgeTypeId |
| `ForgeTypeId Radians { get; }` | `UnitTypeId.Radians` | ForgeTypeId |
| `ForgeTypeId RadiansPerSecond { get; }` | `UnitTypeId.RadiansPerSecond` | ForgeTypeId |
| `ForgeTypeId Rankine { get; }` | `UnitTypeId.Rankine` | ForgeTypeId |
| `ForgeTypeId RankineInterval { get; }` | `UnitTypeId.RankineInterval` | ForgeTypeId |
| `ForgeTypeId RatioTo1 { get; }` | `UnitTypeId.RatioTo1` | ForgeTypeId |
| `ForgeTypeId RatioTo10 { get; }` | `UnitTypeId.RatioTo10` | ForgeTypeId |
| `ForgeTypeId RatioTo12 { get; }` | `UnitTypeId.RatioTo12` | ForgeTypeId |
| `ForgeTypeId RevolutionsPerMinute { get; }` | `UnitTypeId.RevolutionsPerMinute` | ForgeTypeId |
| `ForgeTypeId RevolutionsPerSecond { get; }` | `UnitTypeId.RevolutionsPerSecond` | ForgeTypeId |
| `ForgeTypeId RiseDividedBy1000Millimeters { get; }` | `UnitTypeId.RiseDividedBy1000Millimeters` | ForgeTypeId |
| `ForgeTypeId RiseDividedBy10Feet { get; }` | `UnitTypeId.RiseDividedBy10Feet` | ForgeTypeId |
| `ForgeTypeId RiseDividedBy120Inches { get; }` | `UnitTypeId.RiseDividedBy120Inches` | ForgeTypeId |
| `ForgeTypeId RiseDividedBy12Inches { get; }` | `UnitTypeId.RiseDividedBy12Inches` | ForgeTypeId |
| `ForgeTypeId RiseDividedBy1Foot { get; }` | `UnitTypeId.RiseDividedBy1Foot` | ForgeTypeId |
| `ForgeTypeId Seconds { get; }` | `UnitTypeId.Seconds` | ForgeTypeId |
| `ForgeTypeId Shaku { get; }` | `UnitTypeId.Shaku` | ForgeTypeId |
| `ForgeTypeId SlopeDegrees { get; }` | `UnitTypeId.SlopeDegrees` | ForgeTypeId |
| `ForgeTypeId SquareCentimeters { get; }` | `UnitTypeId.SquareCentimeters` | ForgeTypeId |
| `ForgeTypeId SquareCentimetersPerMeter { get; }` | `UnitTypeId.SquareCentimetersPerMeter` | ForgeTypeId |
| `ForgeTypeId SquareFeet { get; }` | `UnitTypeId.SquareFeet` | ForgeTypeId |
| `ForgeTypeId SquareFeetPer1000BritishThermalUnitsPerHour { get; }` | `UnitTypeId.SquareFeetPer1000BritishThermalUnitsPerHour` | ForgeTypeId |
| `ForgeTypeId SquareFeetPerFoot { get; }` | `UnitTypeId.SquareFeetPerFoot` | ForgeTypeId |
| `ForgeTypeId SquareFeetPerKip { get; }` | `UnitTypeId.SquareFeetPerKip` | ForgeTypeId |
| `ForgeTypeId SquareFeetPerSecond { get; }` | `UnitTypeId.SquareFeetPerSecond` | ForgeTypeId |
| `ForgeTypeId SquareFeetPerTonOfRefrigeration { get; }` | `UnitTypeId.SquareFeetPerTonOfRefrigeration` | ForgeTypeId |
| `ForgeTypeId SquareInches { get; }` | `UnitTypeId.SquareInches` | ForgeTypeId |
| `ForgeTypeId SquareInchesPerFoot { get; }` | `UnitTypeId.SquareInchesPerFoot` | ForgeTypeId |
| `ForgeTypeId SquareMeterKelvinsPerWatt { get; }` | `UnitTypeId.SquareMeterKelvinsPerWatt` | ForgeTypeId |
| `ForgeTypeId SquareMeters { get; }` | `UnitTypeId.SquareMeters` | ForgeTypeId |
| `ForgeTypeId SquareMetersPerKilonewton { get; }` | `UnitTypeId.SquareMetersPerKilonewton` | ForgeTypeId |
| `ForgeTypeId SquareMetersPerKilowatt { get; }` | `UnitTypeId.SquareMetersPerKilowatt` | ForgeTypeId |
| `ForgeTypeId SquareMetersPerMeter { get; }` | `UnitTypeId.SquareMetersPerMeter` | ForgeTypeId |
| `ForgeTypeId SquareMetersPerSecond { get; }` | `UnitTypeId.SquareMetersPerSecond` | ForgeTypeId |
| `ForgeTypeId SquareMillimeters { get; }` | `UnitTypeId.SquareMillimeters` | ForgeTypeId |
| `ForgeTypeId SquareMillimetersPerMeter { get; }` | `UnitTypeId.SquareMillimetersPerMeter` | ForgeTypeId |
| `ForgeTypeId StationingFeet { get; }` | `UnitTypeId.StationingFeet` | ForgeTypeId |
| `ForgeTypeId StationingMeters { get; }` | `UnitTypeId.StationingMeters` | ForgeTypeId |
| `ForgeTypeId StationingSurveyFeet { get; }` | `UnitTypeId.StationingSurveyFeet` | ForgeTypeId |
| `ForgeTypeId Steradians { get; }` | `UnitTypeId.Steradians` | ForgeTypeId |
| `ForgeTypeId Therms { get; }` | `UnitTypeId.Therms` | ForgeTypeId |
| `ForgeTypeId ThousandBritishThermalUnitsPerHour { get; }` | `UnitTypeId.ThousandBritishThermalUnitsPerHour` | ForgeTypeId |
| `ForgeTypeId TonneForceMeters { get; }` | `UnitTypeId.TonneForceMeters` | ForgeTypeId |
| `ForgeTypeId TonneForceMetersPerMeter { get; }` | `UnitTypeId.TonneForceMetersPerMeter` | ForgeTypeId |
| `ForgeTypeId Tonnes { get; }` | `UnitTypeId.Tonnes` | ForgeTypeId |
| `ForgeTypeId TonnesForce { get; }` | `UnitTypeId.TonnesForce` | ForgeTypeId |
| `ForgeTypeId TonnesForcePerMeter { get; }` | `UnitTypeId.TonnesForcePerMeter` | ForgeTypeId |
| `ForgeTypeId TonnesForcePerSquareMeter { get; }` | `UnitTypeId.TonnesForcePerSquareMeter` | ForgeTypeId |
| `ForgeTypeId TonsOfRefrigeration { get; }` | `UnitTypeId.TonsOfRefrigeration` | ForgeTypeId |
| `ForgeTypeId UsGallons { get; }` | `UnitTypeId.UsGallons` | ForgeTypeId |
| `ForgeTypeId UsGallonsPerHour { get; }` | `UnitTypeId.UsGallonsPerHour` | ForgeTypeId |
| `ForgeTypeId UsGallonsPerMinute { get; }` | `UnitTypeId.UsGallonsPerMinute` | ForgeTypeId |
| `ForgeTypeId UsSurveyFeet { get; }` | `UnitTypeId.UsSurveyFeet` | ForgeTypeId |
| `ForgeTypeId UsTonnesForce { get; }` | `UnitTypeId.UsTonnesForce` | ForgeTypeId |
| `ForgeTypeId UsTonnesMass { get; }` | `UnitTypeId.UsTonnesMass` | ForgeTypeId |
| `ForgeTypeId VoltAmperes { get; }` | `UnitTypeId.VoltAmperes` | ForgeTypeId |
| `ForgeTypeId VoltAmperesPerSquareFoot { get; }` | `UnitTypeId.VoltAmperesPerSquareFoot` | ForgeTypeId |
| `ForgeTypeId VoltAmperesPerSquareMeter { get; }` | `UnitTypeId.VoltAmperesPerSquareMeter` | ForgeTypeId |
| `ForgeTypeId Volts { get; }` | `UnitTypeId.Volts` | ForgeTypeId |
| `ForgeTypeId Watts { get; }` | `UnitTypeId.Watts` | ForgeTypeId |
| `ForgeTypeId WattsPerCubicFoot { get; }` | `UnitTypeId.WattsPerCubicFoot` | ForgeTypeId |
| `ForgeTypeId WattsPerCubicFootPerMinute { get; }` | `UnitTypeId.WattsPerCubicFootPerMinute` | ForgeTypeId |
| `ForgeTypeId WattsPerCubicMeter { get; }` | `UnitTypeId.WattsPerCubicMeter` | ForgeTypeId |
| `ForgeTypeId WattsPerCubicMeterPerSecond { get; }` | `UnitTypeId.WattsPerCubicMeterPerSecond` | ForgeTypeId |
| `ForgeTypeId WattsPerFoot { get; }` | `UnitTypeId.WattsPerFoot` | ForgeTypeId |
| `ForgeTypeId WattsPerMeter { get; }` | `UnitTypeId.WattsPerMeter` | ForgeTypeId |
| `ForgeTypeId WattsPerMeterKelvin { get; }` | `UnitTypeId.WattsPerMeterKelvin` | ForgeTypeId |
| `ForgeTypeId WattsPerSquareFoot { get; }` | `UnitTypeId.WattsPerSquareFoot` | ForgeTypeId |
| `ForgeTypeId WattsPerSquareMeter { get; }` | `UnitTypeId.WattsPerSquareMeter` | ForgeTypeId |
| `ForgeTypeId WattsPerSquareMeterKelvin { get; }` | `UnitTypeId.WattsPerSquareMeterKelvin` | ForgeTypeId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```